## Nama : Sael Samuel Rude'
## NIM : 2009106034

### Import Liblary

In [16]:
import numpy as np
import pandas as pd
import sklearn

### Baca File CSV

In [12]:
df = pd.read_csv("Bank Customer Churn Prediction.csv")
df.head()

,customer_id,credit_score,country,gender,age,tenure,balance,products_number,credit_card,active_member,estimated_salary,churn
0,15634602.0,619.0,France,Female,42.0,2.0,0.00,1.0,1.0,1.0,101348.88,1.0
1,15647311.0,608.0,Spain,Female,41.0,1.0,83807.86,1.0,0.0,1.0,112542.58,0.0
2,15619304.0,502.0,France,Female,42.0,8.0,159660.80,3.0,1.0,0.0,113931.57,1.0
3,15701354.0,699.0,France,Female,39.0,1.0,0.00,2.0,0.0,0.0,93826.63,0.0
4,15737888.0,850.0,Spain,Female,43.0,2.0,125510.82,1.0,1.0,1.0,79084.10,0.0

## Training set dan testing set 70:30

In [18]:
X = df[['customer_id','credit_score','country','gender','age','tenure','balance','products_number','credit_card',
             'active_member','estimated_salary']]
Y = df['churn']

In [19]:
from sklearn.model_selection import train_test_split

In [20]:
X_train, X_test, y_train, y_test = train_test_split(X, Y, test_size=0.3)

test_size=0.3 -> banyak test size 30%, training set auto 70%

In [21]:
print("Dimensi X_train : ", X_train.shape)
print("Dimensi X_test : ", X_test.shape)
print("Dimensi y_train : ", y_train.shape)
print("Dimensi y_test : ", y_test.shape)

Dimensi X_train :  (7031, 11)
Dimensi X_test :  (3014, 11)
Dimensi y_train :  (7031,)
Dimensi y_test :  (3014,)

## Data Normalization

In [25]:
from sklearn.preprocessing import MinMaxScaler
df.head()

,customer_id,credit_score,country,gender,age,tenure,balance,products_number,credit_card,active_member,estimated_salary,churn
0,15634602.0,619.0,France,Female,42.0,2.0,0.00,1.0,1.0,1.0,101348.88,1.0
1,15647311.0,608.0,Spain,Female,41.0,1.0,83807.86,1.0,0.0,1.0,112542.58,0.0
2,15619304.0,502.0,France,Female,42.0,8.0,159660.80,3.0,1.0,0.0,113931.57,1.0
3,15701354.0,699.0,France,Female,39.0,1.0,0.00,2.0,0.0,0.0,93826.63,0.0
4,15737888.0,850.0,Spain,Female,43.0,2.0,125510.82,1.0,1.0,1.0,79084.10,0.0

In [27]:
min_max_scaler = MinMaxScaler()
x_scaled = min_max_scaler.fit_transform(df[['credit_score','tenure','balance', 'estimated_salary']])
data_normalization = pd.DataFrame(x_scaled)
data_normalization.head(5)

       0    1         2         3
0  0.538  0.2  0.000000  0.506735
1  0.516  0.1  0.334031  0.562709
2  0.304  0.8  0.636357  0.569654
3  0.698  0.1  0.000000  0.469120
4  1.000  0.2  0.500246  0.395400

## Data Standarization

In [28]:
from sklearn.preprocessing import StandardScaler

In [29]:
ss = StandardScaler()

In [31]:
x_skala = ss.fit_transform(df[['credit_score','tenure','balance', 'estimated_salary']])

In [32]:
data_standarisasi = pd.DataFrame(x_skala)

In [33]:
data_standarisasi.head(5)

          0         1         2         3
0 -0.327300 -1.041765 -1.224678  0.021775
1 -0.441093 -1.387591  0.118612  0.216478
2 -1.537644  1.033192  1.334399  0.240638
3  0.500285 -1.387591 -1.224678 -0.109066
4  2.062353 -1.041765  0.787036 -0.365497

## Data Cleaning

In [38]:
from sklearn.impute import SimpleImputer

### Menampilkan nilai null di setiap atribut

In [41]:
df.isna().sum()

customer_id         41
credit_score        41
country             58
gender              55
age                 43
tenure              41
balance             54
products_number     41
credit_card         41
active_member       41
estimated_salary    53
churn               41
dtype: int64

### Merubah nilai null dengan ketentuan :
bilangan bulat : median/modus, 
bilangan desimal : mean, 
tulisan : modus

In [40]:
imputerMedian = SimpleImputer(strategy='median')
imputerMean = SimpleImputer(strategy='mean')
imputerModus = SimpleImputer(strategy='most_frequent')

memilih strategy untuk tiap atribut

In [42]:
df.head()

,customer_id,credit_score,country,gender,age,tenure,balance,products_number,credit_card,active_member,estimated_salary,churn
0,15634602.0,619.0,France,Female,42.0,2.0,0.00,1.0,1.0,1.0,101348.88,1.0
1,15647311.0,608.0,Spain,Female,41.0,1.0,83807.86,1.0,0.0,1.0,112542.58,0.0
2,15619304.0,502.0,France,Female,42.0,8.0,159660.80,3.0,1.0,0.0,113931.57,1.0
3,15701354.0,699.0,France,Female,39.0,1.0,0.00,2.0,0.0,0.0,93826.63,0.0
4,15737888.0,850.0,Spain,Female,43.0,2.0,125510.82,1.0,1.0,1.0,79084.10,0.0

In [45]:
df["customer_id"] = imputerMedian.fit_transform(df[["customer_id"]])
df["credit_score"] = imputerMedian.fit_transform(df[["credit_score"]])
df["country"] = imputerModus.fit_transform(df[["country"]])
df["gender"] = imputerModus.fit_transform(df[["gender"]])
df["age"] = imputerMedian.fit_transform(df[["age"]])
df["tenure"] = imputerMedian.fit_transform(df[["tenure"]])
df["balance"] = imputerMean.fit_transform(df[["balance"]])
df["products_number"] = imputerMedian.fit_transform(df[["products_number"]])
df["credit_card"] = imputerMedian.fit_transform(df[["credit_card"]])
df["active_member"] = imputerMedian.fit_transform(df[["active_member"]])
df["estimated_salary"] = imputerMean.fit_transform(df[["estimated_salary"]])
df["churn"] = imputerMedian.fit_transform(df[["churn"]])

hasil program

In [46]:
df.isna().sum()

customer_id         0
credit_score        0
country             0
gender              0
age                 0
tenure              0
balance             0
products_number     0
credit_card         0
active_member       0
estimated_salary    0
churn               0
dtype: int64

### Menghapus data duplikat

#### Data duplicate sebelum dihapus

In [54]:
df.duplicated().sum()

57

In [55]:
df[df.duplicated()].head()

,customer_id,credit_score,country,gender,age,tenure,balance,products_number,credit_card,active_member,estimated_salary,churn
63,15751208.0,684.0,Spain,Male,56.0,8.0,78707.16,1.0,1.0,1.0,99398.36,0.0
158,15705512.0,668.0,Germany,Female,37.0,6.0,167864.40,1.0,1.0,0.0,115638.29,0.0
212,15811127.0,521.0,France,Male,35.0,6.0,96423.84,1.0,1.0,0.0,10488.44,0.0
330,15697307.0,588.0,Spain,Male,34.0,10.0,0.00,2.0,1.0,0.0,79078.91,0.0
447,15620505.0,594.0,Spain,Female,24.0,0.0,97378.54,1.0,1.0,1.0,71405.17,0.0

#### Data duplicate setelah dihapus

In [56]:
df.drop_duplicates(inplace = True)

In [57]:
df.duplicated().sum()

0

### Ganti tipe data salah satu attribute angka

In [58]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 9988 entries, 0 to 9999
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   customer_id       9988 non-null   float64
 1   credit_score      9988 non-null   float64
 2   country           9988 non-null   object
 3   gender            9988 non-null   object
 4   age               9988 non-null   float64
 5   tenure            9988 non-null   float64
 6   balance           9988 non-null   float64
 7   products_number   9988 non-null   float64
 8   credit_card       9988 non-null   float64
 9   active_member     9988 non-null   float64
 10  estimated_salary  9988 non-null   float64
 11  churn             9988 non-null   float64
dtypes: float64(10), object(2)
memory usage: 1014.4+ KB

#### Ubah customer_id dan age menjadi int

In [59]:
df['customer_id'] = df['customer_id'].astype('int64')
df['age'] = df['age'].astype('int64')

df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 9988 entries, 0 to 9999
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   customer_id       9988 non-null   int64
 1   credit_score      9988 non-null   float64
 2   country           9988 non-null   object
 3   gender            9988 non-null   object
 4   age               9988 non-null   int64
 5   tenure            9988 non-null   float64
 6   balance           9988 non-null   float64
 7   products_number   9988 non-null   float64
 8   credit_card       9988 non-null   float64
 9   active_member     9988 non-null   float64
 10  estimated_salary  9988 non-null   float64
 11  churn             9988 non-null   float64
dtypes: float64(8), int64(2), object(2)
memory usage: 1014.4+ KB

## Encoding

In [61]:
from sklearn.preprocessing import OneHotEncoder

In [63]:
encoder = OneHotEncoder(sparse=False)
df.head()

,customer_id,credit_score,country,gender,age,tenure,balance,products_number,credit_card,active_member,estimated_salary,churn
0,15634602,619.0,France,Female,42,2.0,0.00,1.0,1.0,1.0,101348.88,1.0
1,15647311,608.0,Spain,Female,41,1.0,83807.86,1.0,0.0,1.0,112542.58,0.0
2,15619304,502.0,France,Female,42,8.0,159660.80,3.0,1.0,0.0,113931.57,1.0
3,15701354,699.0,France,Female,39,1.0,0.00,2.0,0.0,0.0,93826.63,0.0
4,15737888,850.0,Spain,Female,43,2.0,125510.82,1.0,1.0,1.0,79084.10,0.0

In [72]:
countryEnc = encoder.fit_transform(df[["country"]])
encoded_country = pd.DataFrame(countryEnc)
country_encoded = encoded_country.join(df['country'])
country_encoded.head()

     0    1    2 country
0  1.0  0.0  0.0  France
1  0.0  0.0  1.0   Spain
2  1.0  0.0  0.0  France
3  1.0  0.0  0.0  France
4  0.0  0.0  1.0   Spain

In [75]:
genderEnc = encoder.fit_transform(df[["gender"]])
encoded_gender = pd.DataFrame(genderEnc)
gender_encoded = encoded_gender.join(df['gender'])
gender_encoded.head(10)

     0    1  gender
0  1.0  0.0  Female
1  1.0  0.0  Female
2  1.0  0.0  Female
3  1.0  0.0  Female
4  1.0  0.0  Female
5  0.0  1.0    Male
6  0.0  1.0    Male
7  1.0  0.0  Female
8  0.0  1.0    Male
9  0.0  1.0    Male